Public Member Functions | Public Attributes | List of all members
API_ElemDifferenceGeneratorState Struct Reference
Element difference generator
Common structure for the element difference generator components. More...
#include <APIdefs_ElementDifferenceGenerator.h>
 Public Member Functions
API_ElemDifferenceGeneratorState (GSConstHandle handle)
API_ElemDifferenceGeneratorState (const IO::Location &location)
 void  | operator= (const API_ElemDifferenceGeneratorState &source)
Assignment operator (from a reference to another instance)
 void  | operator= (API_ElemDifferenceGeneratorState &&source)
Assignment operator (from a reference to another instance)
 Public Attributes
 API_ElemDifferenceGeneratorStateType  | stateType
The type of the difference generator state.
 GSHandle  | stateHdl
The effective state of the difference generator, if the stateType is APIDiffState_InMemory.
 IO::Location  | fileLocation
The path of the file, that will be use if the stateType is APIDiffState_InFile.
 API_Guid  | viewGuid
The view guid, that will assure that the difference come from used element change not from the view settings, used only in APIDiff_ContextBased generator.
Detailed Description
Common structure for the element difference generator components.
Remarks
This structure specify the difference generator state. You can get a elemenet state by the ACAPI_DifferenceGenerator_GetState function, and use in ACAPI_DifferenceGenerator_GenerateDifference function.